data/DUCT/AR_14_Ret_180/constant/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "constant";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
31819
(
(0.0005 4.597582821e-05 4.712924485e-05)
(0.0005 0.0001337478639 4.712924485e-05)
(0.0005 0.0002135406236 4.712924485e-05)
(0.0005 0.0002860794961 4.712924485e-05)
(0.0005 0.0003520239255 4.712924485e-05)
(0.0005 0.0004119734069 4.712924485e-05)
(0.0005 0.0004664729354 4.712924485e-05)
(0.0005 0.0005160179614 4.712924485e-05)
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<vector> 
677
(
(0.0005 0.001 4.712924485e-05)
(0.0005 0.001 0.000141083062)
(0.0005 0.001 0.0002344295036)
(0.0005 0.001 0.0003271724961)
(0.0005 0.001 0.0004193159407)
(0.0005 0.001 0.0005108637131)
(0.0005 0.001 0.0006018196641)
(0.0005 0.001 0.0006921876197)
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<vector> 
47
(
(0.0005 4.597582821e-05 0.0144)
(0.0005 0.0001337478639 0.0144)
(0.0005 0.0002135406236 0.0144)
(0.0005 0.0002860794961 0.0144)
(0.0005 0.0003520239255 0.0144)
(0.0005 0.0004119734069 0.0144)
(0.0005 0.0004664729355 0.0144)
(0.0005 0.0005160179614 0.0144)
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
