data/DUCT/AR_14_Ret_180/constant/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
31819
(
4.597582821e-05
0.0001337478639
0.0002135406236
0.0002860794961
0.0003520239255
0.0004119734069
0.0004664729354
0.0005160179614
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<scalar> 
677
(
0.001
0.001
0.001
0.001
0.001
0.001
0.001
0.001
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<scalar> 
47
(
4.597582821e-05
0.0001337478639
0.0002135406236
0.0002860794961
0.0003520239255
0.0004119734069
0.0004664729355
0.0005160179614
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
