data/DUCT/AR_14_Ret_180/constant/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
31819
(
4.712924485e-05
4.712924485e-05
4.712924485e-05
4.712924485e-05
4.712924485e-05
4.712924485e-05
4.712924485e-05
4.712924485e-05
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<scalar> 
677
(
4.712924485e-05
0.000141083062
0.0002344295036
0.0003271724961
0.0004193159407
0.0005108637131
0.0006018196641
0.0006921876197
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<scalar> 
47
(
0.0144
0.0144
0.0144
0.0144
0.0144
0.0144
0.0144
0.0144
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
