data/DUCT/AR_14_Ret_180/0/k_LES
k_LES nonuniform List<scalar>
31819
(
5.1129836379050095
5.621329884151908
6.43768254609473
7.401698005845622
8.414902928472312
9.415911918800742
10.409543128278932
11.398213097506602
...
);
