data/DUCT/AR_14_Ret_180/0/tauij_LES
tauij_LES nonuniform List<symmTensor>
31819
(
(4.8233875893035885 0.2981790095341164 -0.0004994386185889877 2.6645184465491534 -0.0013203091142386138 2.7380611525150504)
(5.48428443572385 0.872977091001228 -0.002957273154746039 2.774599366018188 -0.0031670362851514543 2.9837758641023173)
(6.5232038142537085 1.3995715546838017 -0.0038213091802970236 2.9596455959420425 -0.0030022707239749057 3.392515617634617)
(7.720465021369 1.8813087710794358 -0.0012519582384374875 3.1979025712190694 -0.0009377088226752655 3.8850283745145937)
(8.948755860066102 2.316606724538516 0.0016574769900123117 3.469600117363846 0.00045943737514429707 4.411449888023248)
(10.129248048574649 2.7056886292508113 0.002650431912225272 3.75291352608968 0.0011659743293203875 4.949662287552535)
(11.301558967884267 3.0572357931221505 0.003250788432100639 4.027675067993072 0.0003126820285392908 5.4898522407880765)
(12.506614931760941 3.378180484264822 0.0013786418952034171 4.284300511531065 -0.0008942185227276946 6.005510732600007)
...
);
